#2. Написать программу, которая возьмет строку и в каждом слове заменит первую букву на заглавную
#Строку ввести с клавиатуры
#Пример: "This is some test STRING"
#Ответ: "This Is Some Test String"

s = input("Enter string: ").title()
print(s)